export const mainTabBar = [
  {
    id: 'home',
    title: 'خانه',
    icon: 'home',
  },
  // {
  //   id: 'about-him',
  //   title: 'احمد الحسن',
  //   icon: 'person',
  // },
  {
    id: 'beliefs',
    title: 'اعتقادات',
    icon: 'chatbubbles',
  },
  {
    id: 'articles',
    title: 'مقالات',
    icon: 'newspaper',
  },
  {
    id: 'search',
    title: 'جستجو',
    icon: 'search',
  },
  {
    id: 'bookmarks',
    title: 'نشانک‌ها',
    icon: 'bookmark',
  },
] as const;

export const sampleDataList = [
  {
    id: 0,
    title: 'مقدمه‌ای بر جریان احمد بصری',
    description: 'زندگی‌نامه و بررسی تحولات زندگی احمد بصری از تولد تا کنون',
    image: 'images/1005.jpeg',
  },
  {
    id: 1,
    title: 'چگونگی پیدایش فرقه یمانی',
    description: 'به دلیل تبلیغات آنان و به دلیل وظیفه ما در دفاع و حمایت از اعتقادات صحیح مهدوی و پاسخ به شبهات',
    image: 'images/1005.jpeg',
  },
  {
    id: 2,
    title: 'حدیث ما اشکل',
    description: 'امید که برایتان مفید باشد و نظر عنایت حضرتش شامل حالمان شود. -پیروان احمد بصری میگویند راه شناخت',
    image: 'images/1010.jpeg',
  },
  {
    id: 3,
    title: 'رجعت',
    description: 'یکی از این باورها، اعتقاد به رَجعت و زنده شدن مردگان و بازگشت آن‌ها در همین دنیا قبل از وقوع',
    image: 'images/1014.jpeg',
  },
  {
    id: 4,
    title: 'حدیث اولهم من البصره',
    description: 'بررسی حدیث اولهم من البصره. بخش اول. یمانیون با تمسک به روایاتی قصد دارند تا احمدالحسن را به',
    image: 'images/1025.jpeg',
  },
  {
    id: 5,
    title: 'وجود نام (محمد) در انجیل',
    description: 'رزاق انصاری با تمسک به حدیثی از امام رضا علیه السلام در مقام اثبات این سخن که (وصیت را کسی جز',
    image: 'images/1059.jpeg',
  },
  {
    id: 6,
    title: 'آیا سِلاح همان علم است؟',
    description: 'در بحث سلاح و اینکه سلاح یکی از راههای تشخیص حجت می‌باشد، اختلافی وجود ندارد، بلکه اختلاف در معنای',
    image: 'images/1067.jpeg',
  },
  {
    id: 7,
    title: 'رد شبهات فتحیه',
    description: 'برای مشاهده مجله فصلنامه‌ی فاطمیه سال 1443 روی این متن کلیک نمایید. جهت شرکت در مسابقه فصلنامه',
    image: 'images/1071.jpeg',
  },
  {
    id: 8,
    title: 'امامت مهدیین',
    description: 'ناظم العقیلی (از رهبران فرقه یمانی) در مقدّمه کتابش این چنین می‌گوید: 1️- ﺑﻴﺎﻥ ﻭ ﺗﻮﺿﻴﺢ ﺍﻳﻦ ﻣﻮﺿﻮﻉ',
    image: 'images/1078.jpeg',
  },
  {
    id: 9,
    title: 'حدیث من ظهری',
    description: 'اصبغ بن نباته رحمه الله می گوید{اصول کافى جلد 2 صفحه 136 روایت 7} خدمت امیرالمؤ منین صلوات الله',
    image: 'images/1025.jpeg',
  },
];
